msg/DeliberativeState.dot
digraph DeliberativeState {

	layout = dot
    node [colorscheme=pastel28]

    subgraph cluster_reasoning {
		color=lightgrey
        REASONING [style=filled, fillcolor=1]
        ADAPTING [style=filled, fillcolor=2]
        label = "Reasoning states"
    }

    subgraph cluster_execution {
		color=lightgrey
        STOPPED [style=filled, fillcolor=3]
        PAUSED [style=filled, fillcolor=4]
        EXECUTING [style=filled, fillcolor=5]
        FINISHED [style=filled, fillcolor=6]
        label = "Execution states"
    }

    INCONSISTENT [style=filled, fillcolor=7]
    DESTROYED [style=filled, fillcolor=8]

    REASONING -> STOPPED
    REASONING -> INCONSISTENT
    REASONING -> DESTROYED
    ADAPTING -> INCONSISTENT
    ADAPTING -> DESTROYED
    STOPPED -> ADAPTING [dir=both]
    STOPPED -> DESTROYED
    PAUSED -> ADAPTING [dir=both]
    PAUSED -> DESTROYED
    EXECUTING -> ADAPTING [dir=both]
    EXECUTING -> STOPPED [dir=both]
    EXECUTING -> PAUSED [dir=both]
    EXECUTING -> FINISHED
    EXECUTING -> DESTROYED
    FINISHED -> ADAPTING [dir=both]
    FINISHED -> DESTROYED
    INCONSISTENT -> DESTROYED
}
